[{"website": "http://www.gmax.com.sg", "name": "G-MAX Reverse Bungy & GX-5 Extreme Swing", "photo": "http://tn.comesingapore.com/img/others/240x240/6/9/0002409.jpg", "hours": "Mon to Thur: 2pm - 1am", "contact": "(+65) 6338 1146", "address": "Clarke Quay, 3E River Valley Road, Singapore 179024", "desc": "The  is Singapore's first bungy ride and works just like the popular game Angry Birds, except you're the human slingshot. It is as its name suggests - bungy-jumping but in the reverse direction. Built and created in New Zealand, the ride is probably not for the faint-hearted, or weak-stomached. Once on it, riders get catapulted up to 60 meters in the air, hitting speeds of up to 200 kilometers per hour and experiencing G Forces similar to those experienced by astronauts in a rocket launch. Feel your feet tangle mid-air for a few moments and enjoy the panoramic views of the Singapore city's skyline before you're lowered to the ground.\nIf you prefer free-falling, try the  instead. The 5-seater capsule is pulled to a near 90-degree angle, 50 meters off the ground, with its riders facing downwards before it is released like a gigantic swing. Feel yourself free-falling and flying out over the Singapore River, reaching speeds of up to 125 kilometers per hour.\nIf you do intend to try out these thrilling rides located at Clarke Quay, do so before heading out to the pubs nearby for drinks, as intoxicated persons will not be permitted to ride."},
{"website": "http://www.singaporecrocfarm.com", "name": "Singapore Crocodile Farm", "photo": "http://tn.comesingapore.com/img/others/240x240/c/8/0000200.jpg", "hours": "Open daily, except on public holidays.", "contact": "(+65) 6288 9385", "address": "790 Upper Serangoon Road, Singapore 534660", "desc": ""},
{"website": "http://www.pub.gov.sg/newater", "name": "NEWater Visitor Centre", "photo": "http://tn.comesingapore.com/img/others/240x240/f/4/0000244.jpg", "hours": "Tues to Sun: 9am - 5.30pm", "contact": "(+65) 6546 7874", "address": "20 Koh Sek Lim Road, Singapore 486593", "desc": "For a tiny country like Singapore, water is naturally a very valuable resource. That's why it is important to collect and use each drop of water more than once. One of Singapore’s four water sources, known as Four National Taps, NEWater is an ultra-clean, high grade reclaimed water.   Find out more about NEWater and how it contributes to Singapore's water story. Over 850,000 visitors have taken a fresh look at water reclamation since the visitor centre opened its doors in February 2003.\r\nThe NEWater Visitor Centre promises fun-filled activities and interactive exhibits to take you on an exciting journey through the water story. Experience going through a filter – just like a water molecule. Use the giant Water Calculators and see how much water is used for each activity at home. Hop onto the raft and take a ride down Singapore's active, beautiful, clean waters. What is NEWater and where does it come from? You'll learn firsthand the answers to these questions through exciting multimedia presentations and games. You'll get to walk on NEWater without getting wet, and even take a bottle of NEWater home. Experience all these and more when you visit the  today.\r\nTo get there, you'll need to hop on board shuttle-bus services that start from  MRT station on the East-West line. For more information, visit the centre's website ."},
{"website": "http://www.tigerlive.com.sg", "name": "TigerLIVE", "photo": "http://tn.comesingapore.com/img/others/240x240/f/6/0000246.jpg", "hours": "Daily from 11am to 8pm (Last admission at 6.30pm).", "contact": "(+65) 6270 7676", "address": "St. James Power Station, 3 Sentosa Gateway, Singapore 098544", "desc": ""},
{"website": "http://riversafari.com.sg", "name": "River Safari", "photo": "http://tn.comesingapore.com/img/others/240x240/c/6/0002502.jpg", "hours": "River Safari opens daily from 9am to 6pm.", "address": "80 Mandai Lake Road, Singapore 729826", "desc": "Among the unique aquatic and terrestrial animals featured in the park are endangered river giants such as:\r\n\r\nVisitors will be able to tour River Safari’s freshwater galleries and immersive exhibits, including the world’s largest freshwater aquarium at the Amazon Flooded Forest and the Giant Panda Forest.\r\nRiver Safari will exhibit many animals from freshwater habitats that were inspired by eight of the world’s iconic rivers as listed below.\r\nAt this river you will see the:\r\n\r\nTravel down to Africa’s deepest river and marvel at\r\n\r\nThe earth’s longest river is home to the\r\n\r\nVenture down to India’s sacred Ganges River, home to\r\n\r\nAt this Australian river zone, visitors can come up-close with\r\n\r\nAt the Mekong River zone, visitors can catch\r\n\r\nFrom 3 April onwards, visitors planning to see the giant pandas can do so only via River Safari. Both pandas are housed at the Yangtze River zone that also features:\r\nVisitors can explore the world’s largest river at three main exhibits: Amazon River Quest, Squirrel Monkey Forest and Amazon Flooded Forest.\r\nVisitors can hop on board a boat that brings them up-close to over 30 fascinating animal species like\r\n\r\nVisitors can step into the Squirrel Monkey Forest and catch the agile and playful squirrel monkeys move through the trees in this walk-through habitat. \r\nVisitors can witness a beautiful and mysterious underwater ecosystem that is home to\r\n\r\nThe centrepiece of the Amazon Flooded Forest is a large aquatic display of the South American rainforest that is submerged every year during the rainy season when the river rises 30 to 40 feet.\r\nHere, visitors can view a surreal world of\r\n\r\nThe Amazon Flooded Forest is the world’s largest freshwater aquarium designed to provide visitors with an immersive experience, enhanced by dim lightings and mystical music.\r\nThis ecological showcase can be seen through underwater viewing galleries at different levels - from the very bottom of the forest floor up to the water’s surface.\r\nAs the boat rides and some exhibits will not be ready until a later date, daily admission during the soft opening phase will be priced at a discounted rate.\r\nVisitors can purchase tickets at Singapore Zoo and River Safari’s ticket booth."},
{"website": "http://www.ura.gov.sg/gallery", "name": "Singapore City Gallery", "photo": "http://tn.comesingapore.com/img/others/240x240/6/7/0001383.jpg", "hours": "Monday - Friday: 9am - 5pm", "contact": "(+65) 6321 8321", "address": "45 Maxwell Road, The URA Centre, Singapore 069118", "desc": "The URA's (Urban Redevelopment Authority)  cannot be more rightfully named. Right here, you will get a bird's eye view of the entire city of Singapore without having to experience the dizzying heights of the  or other elevated vantage points!\r\nThe gallery showcases the architectural landmarks and urban development of our country through fine, exquisite and detailed miniature models, as well as 3-dimensional, interactive displays which will give you a realistic experience of viewing Singapore from the top. These exhibits will allow visitors to watch Singapore's transformation from an uninhabited jungle island in 1819 to the first-world city it is known as in the 21st century.\r\nIf these mere exhibitions are not enough to interest you, don't worry. Check out the following thematic displays:\r\n1. Orientation\r\nPeople complete a city. Their ways of life, culture and activities add vibrance to an empty metropolis and allow the city to come alive with its own unique personality. Take part in an interactive quiz-show - no prizes to be won, unfortunately, but you will gain valuable insight on Singapore's city planning and its role in today's globalised world.\r\n2. History\r\nEvery country would not be complete without a sense of its history. From the day of Singapore's founding to present day, Singapore has been through countless trials and tribulations. Discover them here at the History section where, with the aid of animation and edutainment equipment, you can see the change in our coastlines through land reclamation and the transformation of 19th century swamps into the bustling towns we know today.\r\n3. Conservation and Heritage\r\nThe URA has come a long way in conserving key buildings that are symbolic to our colonial days. These buildings define what we used to be and how we've changed. Some of the more well-known of such buildings are the , which are very commonly seen in  and . Here, you can observe the development of the shophouse districts stage by stage. You will also be able to witness how conservation efforts by the URA help ensure that while buildings are renovated to keep a clean appearance, the essence that these houses bring out remain untainted by urban developments.\r\n4. Planning\r\nWitness the behind-the-scene efforts that go into ensuring our land capacity is maximised and utilised well! In this section, interactive animations present a realistic experience of issues faced by the government when it comes to sustainable planning.\r\n5. City Centre\r\nAt this final section, aspiring architects can get their very own hands-on experience using planning tools, which you can use to simulate the planning efforts by the URA. Do not miss the light-and-sound show which takes you through time, allowing you to see the growth of Singapore through your very own eyes. The show is screened six times a day."},
{"name": "Haw Par Villa", "photo": "http://tn.comesingapore.com/img/others/240x240/6/c/0000108.jpg", "hours": "Daily from 9am to 7pm.", "contact": "(+65) 6872 2003", "address": "262 Pasir Panjang Road, Singapore", "desc": "Discover the mystical world of Chinese folklore and mythology in an unusual theme park style at .\nLocated along Pasir Panjang Road, near , Haw Par Villa was originally built by Aw Boon Haw for his brother Aw Boon Par to stay in, with a public area for families to share and recount their traditional Chinese tales and legends. The villa was extremely expensive and took years to build. Its original name was Tiger Balm Gardens, after the popular medical remedy invented by the brothers.\nIn 1979, the villa was called Haw Par Villa when it came under the management of the . Five years later, it was reopened as an Chinese theme park. Learn about Chinese folklore here at the grounds of the villa, which has over 1000 statues and 150 giant tableaux, all exhibits of traditional Chinese stories. The villa is famous for its eeriest, creepiest attraction: the '10 Courts of Hell', a graphic representation of the different trials a person's soul would have to go through in the afterlife before being allowed into heaven.\nAttractions like the dragon ride and puppet shows are no longer available at Haw Par Villa. Nevertheless, it still deserves a visit, if just to see Chinese legends shown unlike anything you've ever seen before -  with the added bonus of being a quiet and tranquil getaway away from busy downtown Singapore.\nAdmission to the park is free."},
{"website": "http://www.flightexperience.com.sg", "name": "Flight Experience", "photo": "http://tn.comesingapore.com/img/others/240x240/8/5/0000133.jpg", "hours": "Sunday - Thursday: 10am - 9pm", "contact": "(+65) 6339 2737‎", "video": "http://www.youtube.com/embed/5I9XDDBoYOM", "address": "Singapore Flyer, 30 Raffles Avenue, #02-06, Singapore", "desc": "Possibly one of the more obscure attractions in Singapore,  offers aviation enthusiasts a turn in the cockpit where you can now take to the skies and fly from airport to airport regardless of whether you actually hold a valid pilot's license.\nFulfill your childhood ambition to be a pilot and head down to Flight Experience for a full-flight simulation. After receiving a full briefing from your instructor, you'll be led to the simulator, where you'll be strapped in and ready to take off.\nAn adrenaline-pumping, thrill-seeking ride though it may be, it also calls for intense concentration since you'd have to hurtle down the runway at enough speed to be airborne at about 2 000 feet and then manage air speed, altitude, heading, be aware of other traffic and observe a number of screens and indicators. Once you've sighted your destination, you'd have to land on its runway, putting into practice all that you've learned to nail the landing and make it safely to the other airport.\nFlight Experience closely mimics airline flight simulators and delivers a perfectly authentic replica cockpit which completely immerses you in your virtual reality, blurring the lines of the imaginary and the real, and fooling you into believing you are genuinely the captain of a jet airliner.\nImmerse yourself in this frighteningly real flight adventure, and earn your virtual wings!"},
{"name": "Labrador Secret Tunnels", "photo": "http://tn.comesingapore.com/img/others/240x240/f/5/0000245.jpg", "hours": "Daily from 9am - 7pm.", "contact": "(+65) 6339 6833", "address": "Labrador Villa Road, Singapore", "desc": "The  aren't really a secret any more. They're still worth a visit, especially if you're a history buff. These abandoned tunnels were used by the British Army during World War II and were rediscovered only recently in 2001, when the  was being established.\r\nThe tunnels are linked to a number of casements that used to serve as posts for 6-inch guns and machine-guns. Tour guides are on hand to  provide commentary, explaining the routines used by British forces to handle explosions and fires that break out during an attack.\r\nA great deal of effort has been taken to preserve the tunnels in their original form. Multimedia and interactive presentations have been also been added to recreate a wartime experience.\r\nAdults: S$8.60\r\nChildren: S$5.35"},
{"website": "http://www.forestadventure.com.sg", "name": "Forest Adventure", "photo": "http://tn.comesingapore.com/img/others/240x240/e/7/0002535.jpg", "hours": "From 10am to 6pm, on Tuesdays to Sundays. Closed on Mondays except during public holidays. Booking is required.", "contact": "(+65) 8100 7420", "address": "Inside Bedok Reservoir Park, Bedok Reservoir Road, Singapore 479244", "desc": "Looking for a tree-mendously fun outdoor adventure? Over at Forest Adventure, there's excitement and fun for adventure seekers, young and old!\r\nSet in the lush greenery of , the Forest Adventure attraction boasts a series of ropeways that wind through the trees. Feel and touch the trees as you navigate your way through a series of obstacle courses comprising of ladders, bridges, swings, nets, trapezes and slides designed to challenge both your balance and agility."},
{"website": "http://www.sdc.com.sg", "name": "Singapore Discovery Centre", "photo": "http://tn.comesingapore.com/img/others/240x240/5/5/0000085.jpg", "hours": "Monday: Closed", "contact": "(+65) 6792 6188", "address": "510 Upper Jurong Road, Singapore 638365", "desc": "The  is a place where creativity meets innovation, promising visitors an enriching and educational tour into Singapore's past. This journey through Singapore's past, present, and future aims to inspire future generations in making Singapore and the world a better place to live.\r\nOpened in 1996 in western Jurong, this 4,500 sq m centre offers a wide range of hands-on exhibits and activities for kids and adults alike. There are 4D motion simulator rides, a 3D cinema with a five-storey-high screen, a shooting gallery and paintball course, as well as virtual reality games.\r\nThe Visionarium, for example, is the world's largest design studio that lets up to 120 participants play the role of city planners, making choices that gradually turn Singapore into the modern city it is today. The visitors even get to see the impact of their choices unfolding before them on a 360-degree panoramic screen. Another exhibit lets visitors take on the job of an 'on-location' broadcast journalist who has to report on events that take place during a simulated terror attack in a train station in Singapore.\r\nGuided tours are available for those who wish to learn more about the history that's briefly touched upon in the exhibits. The military roots of this centre are seen in the displays of aircraft, weapons and military equipment used by Singapore's Armed Forces.\r\nThe centre offers a range of ticket categories. A standard adult and child ticket is about $10 and $6 respectively. Families can opt for packages that are tailored to their needs.\r\nFor more information about the Singapore Discovery Centre, please visit its ."},
{"website": "http://www.omnitheatre.com.sg", "name": "Omni-Theatre", "photo": "http://tn.comesingapore.com/img/others/240x240/1/4/0001812.jpg", "hours": "Daily from 10am - 6pm.", "contact": "(+65) 6425 2500", "address": "21 Jurong Town Hall Road, Singapore 609433", "desc": "Located just beside the popular , the Omni-Theatre is Singapore's only IMAX dome theatre. The cinema features crystal clear images and wraparound digital surround sound. Films and thrill-ride simulations are shown on a huge 5-storey dome screen which envelopes you on your reclining seat, far exceeding your field of vision. The experience is made even more unforgettable by the fidelity of the surround sound system.\r\nThis massive cinema presents short but utterly immersive show in quality large format films, with a wide range of genres, including science, space, nature, animals, marine life, culture and natural disasters. Perforations in the screen allow both sound and air-conditioning to pass through to the audience\r\nBeyond the cinema, check out the space science exhibitions and gifts shop. The complex is also home to an observatory and omniplanetarium, and is one of the few observatories in the world located close to the Equator. Hence, constellations in both the northern and southern celestial hemispheres can be observed from here. The Observatory is open to the public for free star-gazing sessions on Friday nights from 7:50pm to 10pm."},
{"website": "http://www.science.edu.sg", "name": "Singapore Science Centre", "photo": "http://tn.comesingapore.com/img/others/240x240/6/0/0000096.jpg", "hours": "Mondays: Closed (except for School and Public Holidays)", "contact": "(+65) 6425 2500", "address": "15 Science Centre Road, Singapore", "desc": "With over 19 exhibit areas and frequent travelling exhibitions, let the Singapore Science Centre entertain you with educational, quirky and hands-on activities that will boggle your mind! It is is home to a huge collection of more than 1000 absorbingly interactive exhibits featuring the science of outer space, the earth, ecosystems, human bodies, technology, and visual illusions. The quirky and hands-on activities are a treat for kids that will engage, entertain, and educate them.\r\nDon't miss the Climate Change exhibit, where you can learn about the changes taking place at the polar regions due to climate change events and watch a shadow puppet show and a short animation on climate change. After familiarising yourself with energy efficiency and clean energy, you can even try your hand at building your own eco-city. Find out your own carbon footprint and pledge to do your part to protect the environment.\r\nAnother featured exhibit at the Singapore Science Centre is the Sound Exhibition. Explore the wonders of sound through interactive stations such as the 'Hearing Range', where you can test your ears' sensitivity to different frequencies, while 'Listen!' allows you to experience how your moods can be affected by music and if you can listen and talk at the same time. Also, watch sound waves in action as sand and iron filings dance to music and explore the phenomenon of resonance through the Hot Air Organ.\r\nAlso check out the Waterworks, an exhibit set up with the Public Utilities Board, the national water agency, where you can learn about Singapore's water purification process and the natural water cycle. Let loose and get wet as you find your way through the water maze and shoot jets of water equivalent to your water usage in daily activities.\r\nYou'll be surprised by what you've yet to discover in the wonderful world of science. Learn together and bond with friends and family in a day of finding treasure troves of exciting nuggets of information!"},
{"website": "http://www.singaporeflyer.com/journey-of-dreams", "name": "Journey of Dreams", "photo": "http://tn.comesingapore.com/img/others/240x240/1/6/0002070.jpg", "hours": "Daily from 8.30am - 10.30pm.", "contact": "(+65) 6333 3311", "address": "30 Raffles Avenue, Singapore", "desc": "The  brings to you the , a mystical and magical flight experience on the Flyer, which combines educational and entertainment value all in one ride. This is all done with the help of special effects and multimedia which engages all your senses in this experience. The sequence of events is as follows:\r\nThe Flyer character welcomes you on-board in different languages! Sit back, relax and enjoy the 3D effects that have you awed by the realistic-looking inner mechanisms of the Flyer.\r\nBe cast into a fantasy-like world at The Dreamscape. Here, you will be mesmerised by the large panoramic screen in front of you, showing rotating patterns and a myriad of colours that all represent the Great Observation Wheel.\r\nAt this stage of the ride, you will be amazed by the hard work, creativity, meticulousness and passion that goes together to ensure the functionality of the Flyer. The 1.5 meter diameter is a device that displays the timeline of the building process of the Flyer, complete with a manual dial that shows you a sequence of images as you turn it.\r\nThis segment brings you a one-of-a-kind experience as you shine a torch onto an old portrait of Singapore. The bright lights that capture your attention are spots that define Singapore in the following key themes: Futuristic, Cosmopolitan and Global City, Garden City and Multi-racial and Cultural City.\r\nIf you do not wish to explore the whole of Singapore to understand its culture and heritage, you will still be able to explore the various chapters in the history of Singapore- right here on the Flyer! Let the series of peepholes tell you the story of Singapore's success.\r\nThis segment of the journey gives you a more personal touch. Be inspired by the personal stories of Singaporeans and their paths to fulfilling their life's greatest dreams and aspirations.\r\nConclude your journey at the Reservoir of Dreams. The Oneiroi’s Orb present a compilation of circular artifacts from the past which are symbolic of the shape of the Flyer. The Planet is an extraordinary technological tool that uses the concept of internal projection within a Puffersphere to depict the transformation of dreams into Singapore. Finally, The Numeric presents the facts and figures of all things related to the Flyer in the most unqiue way you will ever imagine."},
{"photo": "http://tn.comesingapore.com/img/others/240x240/c/6/0000198.jpg", "video": "http://www.youtube.com/embed/5LDYcoSEfbY", "name": "Singapore River Cruises and Leisure"},
{"website": "http://www.singaporeflyer.com", "name": "Singapore Flyer", "photo": "http://tn.comesingapore.com/img/others/240x240/8/3/0000131.jpg", "hours": "Daily from 8.30am - 10.30pm.", "contact": "(+65) 6333 3311", "video": "http://www.youtube.com/embed/J4ZDbZsNsPE", "address": "30 Raffles Avenue, Singapore", "desc": "Ride the world's largest observation wheel, the , and be entranced by the awe-inspiring views of the city, including Singapore's latest attraction, the  integrated resort.\nStanding at a grand height of 165 metres, 30 metres more than the London Eye, the Singapore Flyer offers magnificent and unique views of Singapore's skyline, encompassing the Central Business District area and the  area, offering panoramic views of Singapore's finest attractions and iconic cityscape.\nThe Singapore Flyer is designed in such a way that each of its fixed cylindrical capsules are fitted with UV-protected glass windows, so that visitors have unobstructed views of the city and Marina Bay below. Each capsule has an air-conditioned interior area of about 28 square metres, and the row of benches allow those who are less courageous to enjoy the views from the comfort of their seats.\nA standard flight lasts about half an hour and the capsule holds up to 28 passengers. Grab an audio guide for a educational and comprehensive overview of the various sights and landmarks seen in your 360 degrees view of the city, or make your flight more enjoyable with a selection of luxurious packages to choose from.\nPersonalise your own corporate or personal event in style with a private capsule, or register for packages such as the Signature Cocktail Flights and the Moët & Chandon Champagne Flight. Delight your tastebuds with a mixture of Gin, Midori, apple and other fruity flavours, or toast to the finer things in life with the finest champagne from Moët & Chandon Champagne, to accompany a selection of decadent chocolate and sweet strawberries tarts, set against the beautiful skyline of the city.\nTake an unforgettable ride on the world's largest observation wheel and see Singapore in a new light with the Singapore Flyer."},
{"website": "http://www.downtowneast.com.sg", "name": "Downtown East", "photo": "http://tn.comesingapore.com/img/others/240x240/6/8/0000104.jpg", "hours": "Wild Wild Wet:", "contact": "(+65) 6589 1688", "address": "1 Pasir Ris Close, Singapore", "desc": "Nothing spells family fun like the all-inclusive Downtown East family resort. With its in-house theme parks, , be prepared for a whole day's worth of thrilling adventure rides for adults and children alike! You can have fun while cooling off from the tropical heat in Wild Wild Wet. Downtown East houses numerous eateries, Singapore's largest indoor playground, the nEbO City cineplex and gaming centre, and a 25-metre high Ferris Wheel, all at E!hub.\r\nIf water rides are more your thing, head over to the neighbouring theme park Wild Wild Wet for some wet thrills and spills. Try out the Ular-Lah for an unforgettable white-water rafting experience or slide down the Waterworks at high speeds for an adrenaline high. Alternatively, spend the day relaxing in calmer waters like the Shiok River, Jacuzzi and even the Tsunami.\r\nTake along a spare change of clothes, waterproof camera and get set for a day of thrill-seeking fun!"},
{"website": "http://www.nightsafari.com.sg", "name": "Night Safari", "photo": "http://tn.comesingapore.com/img/others/240x240/8/1/0000129.jpg", "hours": "Daily from 7.30pm - 12 midnight.", "contact": "(+65) 6269 3411", "video": "http://www.youtube.com/embed/eOSmY7gT4bg", "address": "80 Mandai Lake Road, Singapore", "desc": "Get up-close and personal with your favourite animals at the , the world's first nocturnal open-concept zoo, home to 1,040 animals of 120 species, receiving over 1.1 million visitors annually. See animals from South America, Myanmar, Asia, Indo-Malaysia, Himalaya, Nepal and even India, including the largest elephant in the Singapore zoos, endangered species such as the Malayan Tapir and Flying Fox, and the Indian Swamp Deer.\r\nRoam around the open-air zoo and visit animals from South America and Asia in their natural habitats, sealed in their enclosures with natural barriers, cattle grids, moats and hot wires.\r\nExplore the eight geographical zones on foot via the walking trails or have a comprehensive overview in the comfort of a tram. Even though darkness has fallen, the animals are still clearly visible thanks to the simulated moonlight which puts the animals at ease and allows them to engage in their own activities. Visitors should refrain from using flash photography as the flash can be damaging to these animals.\r\nFrom 7.30 pm onwards, the park comes alive with all sorts of activities. For a warm reception, check out the cultural performances with tribal dances, fire eating displays, and even blowpipe demonstrations. Watch the Creatures of The Night in action at the forest clearing for the show and observe their behaviour, whether it be the owls, binturongs or even civets. Make sure to be on time for the show since you'll not be admitted once the show has begun. Show times are at 7.30 pm, 8.30 pm and 9.30 pm, with an additional show at 10.30 pm on Fridays, Saturdays and eves of public holidays.\r\nHop on the tram ride and catch the majestic Chawang, the largest elephant in the Singapore zoos. His tusks are close to 1.2 metres long, he stands at an awesome height of almost 3 metres and weighs a hefty 3480 kg. He’s also had the honour of siring three elephants in the zoo.\r\nThe zoo is also home to a couple of endangered species such as the Malayan tapir and the Indian swamp deer or baransingha. The Malayan tapir is unmistakable with its distinct black-and-white coat pattern, while the baransingha has twelve or more prongs on each of its antlers.\r\nIn the Leopard Trail, visitors witness the leopards in all their feline glory. Admire their lithe forms as they prowl around their habitat and also look out for the tarsiers with their enormous eyes that aid them in spotting their prey in the dark. In the same trail, you’ll also be able to find Malay and small-toothed civets. When provoked, the civets, like skunks, let out foul-smelling secretions, which are sometimes used in perfumes in diluted amounts.\r\nWander down the Fishing Cat Trail to see the fishing cats, mouse deer and the largest bat in the world, the Malayan flying fox. Observe how the fishing cats, after moments of intense staring at their prey, smoothly lunge into the water and pin their prey down. The mouse deer in this trail are not blessed with the antlers that most deer have. Instead, the males have elongated canines that serve as a form of defense. The Malayan flying foxes have incredible wingspans that can reach up to 1.83 metres but they only weigh about 1.5 kg.\r\nThe Forest Giant Trail is one of the few untouched primary forests in Singapore and is famous for its native plants, which have had unrestricted room to grow. Some of these trees have reached dizzying heights of 45 metres and are home to flying lemurs, night jars, squirrels, owls and tree shrews.\r\nTake a leisurely walk around the zoo until it closes at 12 midnight. The admission fee (which includes the tram ride) is S$32 for adults and S$21 for children from 3 to 12 years. Opt for a Park Hopper if you intend to visit the  and the  as well.\r\nVisit during October for a haunting twist. On certain nights, usually Fridays and Saturday nights during the month, the park is turned into a scare-fest with the Halloween Horrors. Sit on the Train of Terror and be prepared for a close encounter of the supernatural kind. If you can't get enough of spooky encounters, head down to the Haunted Forest Giants Trail and enter the Bats' Cave. Beware the creatures and custodians that await you in the cave.\r\nA tour around the Haunted Village is not to be missed during this time as well. Make your way into this strange village and beware of trap doors and ghouls. If you do make it out of this village (part of which enters into the ), festivities await you at the end. Adults pay S$40 and the children's rate is S$30.\r\nCome to the Night Safari for a unique zoo visit and catch nocturnal animals in their natural habitats."},
{"website": "http://www.snowcity.com.sg", "name": "Snow City", "photo": "http://tn.comesingapore.com/img/others/240x240/6/9/0000105.jpg", "hours": "Monday: Closed on Monday (except on school and public holidays)", "contact": "(+65) 6560 2306 / (+65) 6560 4773", "address": "21 Jurong Town Hall Road, Snow City Building, Singapore", "desc": "Experiencing snow in Singapore's tropical climate may seem like a bizarre oxymoron. However, it has become a reality in , Singapore's first permanent snow centre, with temperatures of -5°C, covering an area of 3000 square metres over 2 storeys.\r\nThe highlight of the main snow chamber is the 60-metre-long and 14° snow slope spanning the entire length of the building, with the gradient from ground level to nearly 3 storeys high. You can conquer the slope in several ways. The easiest way would be to play it safe with 'snowtubing', where you sit on inflatable snow tubes and slide down the snow slope in a variety of ways. It's safe and fun for the whole family.\r\nIf you're after the adrenaline high, try out snowboarding and skiing. Make the necessary arrangements with the staff and get a crash course with qualified instructors so you can get down to the action quickly.\r\nTiny toddlers and children need not be left out of the fun. There's a snow play area with slides and a mini house for a good hour or two of entertainment while you warm with the perennial winter favourite - hot chocolate. There are also ice bars for you to hang out in, or choose to get a souvenir from the only place in Singapore with sub zero temperatures.\r\nWhether it's just for the surreal factor of actually getting to enjoy 'winter' in a tropical country, or to get in some serious snowtubing or skiing action, Snow City is definitely a memorable attraction to visit. In addition, the ticket also grants you entry to the neighbouring . Remember to wear covered pants on the day of your visit. Save precious luggage space and rent skiwear from the Snow City."},
{"website": "http://www.birdpark.com.sg", "name": "Jurong Bird Park", "photo": "http://tn.comesingapore.com/img/others/240x240/6/4/0000100.jpg", "hours": "Daily from 8.30am - 6pm (Last ticket sale at 5.30pm).", "contact": "(+65) 6265 0022", "video": "http://www.youtube.com/embed/_NxOnSabf_8", "address": "2 Jurong Hill, Singapore", "desc": "With more than 8,000 birds from 600 species, come meet our feathered friends at the  for an entertaining and educational experience! The Jurong Bird Park, with its 20.2 hectares of land, is the largest bird park in the world and is also an award-winning attraction, with 900 000 visitors in 2009 alone, winning awards for its conservation, breeding and research efforts. Must-see exhibits here include the Lory Loft Aviary, Dinosaur Descendants, Birds of Prey Show and Birds and Buddies Show, as well as the tallest man-made waterfall in the world.\r\nThe beautifully landscaped setting of waterfalls and free flight aviaries make for a lovely walk. Explore the world’s largest walk-in lory aviary at the Lory Loft Aviary. The Australian rainforest aviary alone covers 3 000 sq. metres and stands at 9 storeys high, with over 1000 free-flying lories. Have fun watching these colourful and fun-loving lories flocking to you as you feed them a special nectar-mix. The feeding times range from 8.30am to 6pm. Also, be sure to visit the African Waterfall Aviary to see the largest man-made waterfall in the world. This majestic sight cascades down through the world's largest walk-in aviary.\r\nTo get a glimpse of what dinosaurs most likely looked like eons ago, head to the Dinosaur Descendants exhibit, featuring 4 different species of flightless birds - the ostrich, the cassowary, the emu and the rhea. At the same area, you can also take a stab at being an archaeologist and unearth various fossils and relics hidden beneath the sand. The World of Darkness exhibit is home to nocturnal owls cast in simulated moonlight. The park is home to many other birds such as flamingoes, hornbills, toucans, pelicans, penguins, crowned pigeons and birds of paradise, and also houses a wet-and-dry playground.\r\nSee the majestic Birds of Prey up-close. From eagles and hawks to vultures and falcons, witness their fearsome hunting behaviour as they snatch food in mid-air, carry out simulated hunts and display their problem-solving abilities in two special shows. The show times for these shows are at 10am for the Fuji World of Hawks and at 4pm for King of the Skies. The venue for both shows is at the Fuji Hawk Walk. Sign up to Be a Falconer and be trained to handle these majestic birds and learn the history of falconry.\r\nOf all the shows in the park, the Birds n Buddies Show has the greatest variety of performing birds in a single live act. This performance is specially choreographed by international creative show specialist Pieter Grove, who has produced Broadway musicals and international adaptations. Be entertained by the stunning visual and audio extravaganza and the antics of the Buddies, colourfully dressed characters and the stars of the show themselves, the birds, ranging from flamingoes to macaws and even penguins. Catch the shows at 11am and 3pm at the Pools Amphitheare for a thoroughly enjoyable performance.\r\nOpt to save a little pocket change by buying a Park Hopper package, which allows you to travel to the  and  and the Bird Park at a discounted rate.\r\nHead down to the Jurong Bird Park to learn more about the avian community and enjoy some of its most well-loved attractions!"},
{"website": "http://www.zoo.com.sg", "name": "Singapore Zoo", "photo": "http://tn.comesingapore.com/img/others/240x240/6/2/0000098.jpg", "hours": "Daily from 8.30am - 6pm (Last ticket sale at 5.30pm)", "contact": "(+65) 6269 3411", "video": "http://www.youtube.com/embed/p4jgx4yNY9I", "address": "80 Mandai Lake Road, Singapore 729826", "desc": "See exotic and endangered animals up close in their natural habitats in the . Voted the best attraction in Singapore on Trip Advisor, and considered one of the best zoos in the world, this attraction is a must see, housing over 2500 mammals, birds and reptiles.\r\nHave a memorable Wild Breakfast with the Asian small-clawed otter, reticulated python or the well-loved orang-utans (S$15.80 for adults and S$11.50 for children). Watch as the orang-utans swing effortlessly from one hold to another in their free-ranging areas. Get a better look at these primates at the boardwalk or take a picture with these apes during their feeding sessions at the Island free-ranging area at 11.30 am and 3.30 pm, or the Boardwalk free-ranging area at 2.15 pm and 4.30 pm respectively.\r\nHop aboard the Elephant Rides for an unforgettable and thrilling ride, or provide the children with bragging rights as they climb aboard the Pony Rides. Other ways to tour the park include the Horse-carriage, boat rides, or the tram, for a quicker and more efficient way to see the park in its entirety.\r\nOther highlights of the zoo include the Fragile Forest, a rainforest ecosystem, and the Bat Exhibit with bats that have a wingspan of 1.7 m. Catch a glimpse of flying squirrels in the Giant Flying Squirrel Exhibit and watch squirrels soar 400 m above the ground.\r\nVisit the animals in their natural habitats. Check out the Elephants of Asia, a one-hectare exhibit featuring the animal and its various historical and cultural associations. This exhibit, designed for the overall comfort of the elephants, has a mud wallow, viewing loft, bathing pool and has several thatched huts inspired by Myanmar's architecture. Walk through the eco-habitat on the elevated boardwalks to observe the elephants' behaviour and check out the amazing views of the reservoir. Educate yourself about elephants and their role in non-destructive logging operations in rainforests.\r\nAnimals from all over the world can be found in the Singapore Zoo. Meet the inhabitants of Australia, Africa, and even the Arctic Circle. You can visit the Australian outback to see grey kangaroos and wallabies wandering about freely and even feed them during their feeding sessions at 11 am and 4 pm. Check out the rustic sheds nearby, featuring a range of reptiles native to Australia. Be sure to look out for the more exotic reptiles such as the frill-necked lizard, the bearded dragon and the carpet python. If you're lucky enough, you might even be able to catch the notoriously shy sugar gliders. Another must-see is the cassowary with its signature vibrant and intimidating helmet.\r\nBe sure to also visit the magnificent African lions in their enclosures. If you want a more personal encounter with the lions, you could actually choose to participate in the Lunch with Lions event, an event that won the Bronze Award for innovation in the International Festivals and Events Association's Pinnacle Awards in 2000. Embark on the adventure, arranged exclusively for only 15 to 21 guests, by boarding the tram which will take you into the heart of Wild Africa and to the Tropical Crops Plantation, providing you with stunning views of the tranquil . Sip on a welcome cocktail before being ushered into the lion viewing gallery, where you will dine alongside the lions. Feast on a sumptuous buffet spread with amazing variety of cold and hot foods, appetizers, vegetables and eventually dessert, accompanied by unparalleled views of the majestic lions.\r\nShould you visit on your birthday, you would be eligible for free entry if you show a form of identification and will also be eligible to enjoy other benefits.\r\nAdult – S$20.00\r\nChild (3 to 12 years old) – S$13.00\r\nChild (Below 3 years old) – Free\r\nSenior Citizens (Singaporeans and Permanent Residents aged 60 & above) – S$10\r\n'Park Hopper' special packages for the Singapore Zoo,  and  are also available, where visits to the three parks need not be in one day.\r\nYou may also wish to purchase the 'Zoo-per Saver' special package for unlimited boat and tram rides, including the zoo's admission fee.\r\nRenowned for its 'open zoo' concept and featuring 2,500 specimens from 315 species of animals, the Singapore Zoo is a must-see on any visitors' itinerary."}]